app/controllers/allocations_controller.rb

SELECT * FROM "projects" WHERE ("projects".organisation_id = 1) ORDER BY name
SELECT * FROM "allocations" WHERE ("allocations".project_id = 3)
SELECT * FROM "allocations"
UPDATE "allocations" SET "updated_at" = '2009-12-06 10:07:49', "allocation_date" = '2009-07-27' WHERE "id" = 116
---
  def index
    projects = @organisation.projects
    allocations = []
    projects.each do |project|
      allocations = allocations + project.allocations
    end
    #@allocations = allocations
    # TODO - remove when run on db
    @allocations = Allocation.find(:all)
    @allocations.each do |a|
      strnoworks = a.allocation_date.to_s(:db)
      a.allocation_date = strnoworks.to_date
      a.save