app/controllers/organisations_controller.rb

SELECT * FROM "organisations" WHERE ("organisations"."id" = 1)
---
  def show
    @organisation = Organisation.find(params[:id])