app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 4) ORDER BY name
---
  def edit
    if session[:administrator]
      @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 4) ORDER BY name
UPDATE "projects" SET "updated_at" = '2009-12-01 17:07:56', "include_weekends" = 't' WHERE "id" = 2
---
  def update
    if session[:administrator]
      @project = Project.find(params[:id])
    else
      @project = @organisation.projects.find(params[:id])
    end

    respond_to do |format|
      if @project.update_attributes(params[:project])