app/controllers/resources_controller.rb

SELECT * FROM "organisations" WHERE ("organisations"."id" = 1)
SELECT count(*) AS count_all FROM "resources" WHERE ("resources".organisation_id = 1)
INSERT INTO "resources" ("name", "created_at", "organisation_id", "updated_at") VALUES('Outsource company', '2009-12-01 17:11:17', 1, '2009-12-01 17:11:17')
---
  def create
    resource = Resource.new(params[:resource])
    resource.organisation_id = @organisation.id #resource belongs to currently logged in organisation
    @resource = resource
    limit = @resource.organisation.resource_limit
    respond_to do |format|
      if @resource.organisation.resources.count >= limit
        flash[:warning] = 'You can only add ' + limit.to_s +  ' resources to your organisation.'
        format.html { render :action => "new" }
      elsif @resource.save