app/controllers/time_controller.rb

  def index
    # get projects and resources
    @projects = @organisation.projects.by_archive_status(false)
    @teams = @organisation.teams
    if session[:team_id]
      @team = @organisation.teams.find(session[:team_id])
---
SELECT * FROM "projects" WHERE ("projects".organisation_id = 1) AND ((archive == 'f') AND ("projects".organisation_id = 1)) ORDER BY name

  def create
    allocations = JSON.parse(params['allocations'])
    @allocations = []
    allocations.each do | a |
      allocation = Allocation.new
      allocation.resource_id = a['resource_id']
      allocation.project_id = a['project_id']
      # parse to date - as oppose to time to ensure date format understood by db
      allocation.allocation_date = Date.parse(a['allocation_date']);
      # check the supplied ids apply to the current organisation
      if @organisation.projects.find(allocation.project_id) and @organisation.resources.find(allocation.resource_id)
        # check if weekends are excluded for project - if so do not create
        workdays = Range.new(1, 5)
        if allocation.project.include_weekends
          workdays = Range.new(0, 6)
        end
        if workdays === allocation.allocation_date.wday()
          if !allocation.save
---
SELECT "allocations".id FROM "allocations" WHERE ("allocations"."allocation_date" = '2009-12-07' AND "allocations".resource_id = 24) LIMIT 1
SELECT * FROM "projects" WHERE ("projects"."id" = 2 AND ("projects".organisation_id = 1)) ORDER BY name
SELECT * FROM "resources" WHERE ("resources"."id" = 24 AND ("resources".organisation_id = 1)) ORDER BY name
INSERT INTO "allocations" ("created_at", "resource_id", "project_id", "updated_at", "allocation_date") VALUES('2009-12-01 17:05:40', 24, 2, '2009-12-01 17:05:40', '2009-12-07')

  def destroy
    allocation_ids = JSON.parse(params['allocations'])
    @allocations = []
      allocation_ids.each do | a |
        allocation = Allocation.find(a['allocation_id'])
        organisation = Organisation.find(session[:organisation_id])
        project = organisation.projects.find(allocation.project.id)
        # check if project in allocation belongs to currently logged in organisation
        if project
          @allocations << allocation
          allocation.destroy
---
SELECT * FROM "allocations" WHERE ("allocations"."id" = 13034)
SELECT * FROM "organisations" WHERE ("organisations"."id" = 1)
SELECT * FROM "projects" WHERE ("projects"."id" = 2 AND ("projects".organisation_id = 1)) ORDER BY name
DELETE FROM "allocations" WHERE "id" = 13034