app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) ORDER BY name LIMIT 1
---
  def index
    if session[:administrator]
      @users = User.find(:all, :order => "organisation_id")